[{"url":"/","sections":[{"type":"Content-section","content":"# Our Mission\nOur mission is to help unhoused people move towards self-sufficiency and a safe home in our community. \n"},{"type":"Content-section","content":"## What We Do\n"},{"type":"Card","content":"### Public Assistance Programs\nWe help clients apply for public assistance programs. With so many programs available, it can be daunting to find the right one. \n\n[Explore our list of public assistance programs](http:///public-assistance).\n"},{"type":"Card","content":"### Resources\nWe work with our clients to explore careers, set goals, and develop contacts. We also find resources for our clients that help them progress towards self-sufficiency.\n\n[Explore our collection of resources.](http:///resources)\n\n"},{"type":"Card","content":"### Mentors\nWe match our clients with mentors who work with them to develop career paths, as well as provide guidance, motivation, emotional support, and role modeling.\n\n"},{"type":"Content-section","content":"## Clients We Serve\n\nOur clients are people in our community who are facing extreme financial hardship. Most of them grew up in the San Francisco Bay Area or have been living and working here for many years before experiencing a single bad event which forced them to live in their cars or on the streets.\n\nAccording to the 2019 Point-in-Time count, 30% of homelessness in Santa Clara County was caused by job loss and another 14% was caused by eviction. \n\nOur clients are resilient and are working hard to overcome these challenges to get back on their feet and become self-sufficient again, but they need help and support from their community. They deserve the chance to have a normal life like everybody else and they deserve to be treated with dignity, respect, and compassion.\n"}]},{"url":"/about","sections":[{"type":"Content-section","content":"# Our Mission\nOur mission is to help unhoused people move towards self-sufficiency and a safe home in our community. \n"},{"type":"Content-section","content":"# Board of Directors\n"},{"type":"Card","content":"## Board Member & President\n### Wei Qun E\nWei is passionate about improving the quality of life for people in need. She believes everyone should have stable housing, nutritious food, access to behavioral health services.\n\nShe is an attorney, a LifeLine phone agent, and a volunteer.\n"},{"type":"Card","content":"## Board Member & Chief Operating Officer\n### Claire Hubel\n\nClaire first remembers being concerned about a homeless person at the age of 8, and this concern has persisted ever since. Before volunteering for The United Effort Organization, she volunteered for many other organizations over the years, including [Hope's Corner](https://www.hopes-corner.org/) in Mountain View.\n\nThrough her volunteer work, she has met a wonderful and diverse population of unhoused people who have enriched her life with their spirit, determination, friendship, and humor.\n"},{"type":"Card","content":"## Board Member & Chief Financial Officer\n### Julie Wang\n\nJulie applies her experience in software and database system design to develop tools for improving work efficiency. She volunteers to help people in need.\n"},{"type":"Card","content":"## Board Member\n### Mike Patrick\n\nMike Patrick is a Silicon Valley corporate attorney. He worked at the firm of Fenwick & West for thirty years, representing high tech companies, and is currently Chief Legal and Compliance Officer at fintech startup Merlyn.AI Corporation. \n\nMike is a past Co-President of Palo Alto based non-profit La Comida and is currently Chair of the Development Committee for Environmental Volunteers, also a Palo Alto based non-profit.\n"},{"type":"Card","content":"## Board Member\n### Tracy Jiang\n\nTracy Jiang is a product manager at Google with over twenty years of industry experience serving both product management and engineering roles.\n\nOutside of work, she served as marketing lead for a non-profit microfinancing organization for five years and helped support many small businesses run by people in poverty. She is passionate in applying her skills to volunteer work and helping people lead a better life.\n"}]},{"url":"/mentors","sections":[{"type":"Content-section","content":"## Find a Mentor\nWe match our clients with mentors who work with them to develop a career path, as well as providing guidance, motivation, emotional support, and role modeling.\n"}]},{"url":"/public-assistance","sections":[{"type":"Markdown-page","content":"# Guides and Assistance\n\nDescriptions of public assistance programs, including eligibility criteria.\n\n\n## Free Phone and Service\n\n- [California LifeLine Phone Program](/public-assistance/california-lifeline-phone-program)\n\n## Cash Assistance\n\n- [The General Assistance Program (GA)](/public-assistance/general-assistance)\n- [California Work Opportunity and Responsibility to Kids (CalWORKs)](/public-assistance/calworks)\n- [Cash Assistance Program for Immigrants (CAPI)](/public-assistance/cash-assistance-program-for-immigrants)\n- [Assistance Dog Special Allowance Program (ADSA)](/public-assistance/assistance-dog-special-allowance)\n\n\n## Tax Assistance\n\n- [Volunteer Income Tax Assistance (VITA)](/public-assistance/volunteer-income-tax-assistance-and-tax-counseling-for-the-elderly)\n- [Tax Counselling for the Elderly (TCE)]((/public-assistance/volunteer-income-tax-assistance-and-tax-counseling-for-the-elderly)\n- [IRS Free File Program](/public-assistance/irs-free-file/)\n- [Earned Income Tax Credit (EITC)](/public-assistance/earned-income-tax-credit/)\n\n\n## Disability Benefits\n\n- [Supplemental Security Income (SSI)](/public-assistance/supplemental-security-income)\n- [Social Security Disability Insurance (SSDI)](/public-assistance/social-security-disability-insurance)\n- [In-Home Supportive Services (IHSS) Program](/public-assistance/in-home-supportive-services/)\n- [VTA Paratransit](/public-assistance/vta-paratransit)\n- [Meals on Wheels](https://www.mealsonwheelsamerica.org/)\n\n## Food and Nutrition\n\n- [CalFresh (formerly known as Food Stamps)](/public-assistance/calfresh)\n\n## Healthcare\n\n- [Medi-Cal](/public-assistance/medi-cal)\n- [Children's Health Insurance Program (CHIP)](/public-assistance/childrens-health-insuarance-program)\n- [California Behavioral Health Services](/public-assistance/california-behavioral-health-services)\n\n## Housing\n\n- [Section 8 Housing Choice Voucher](/public-assistance/section-8-housing-choice-voucher)\n- [Section 8 Project-Based Voucher (PBV) Program](/public-assistance/section-8-project-based-voucher-program)\n\n## Employment\n\n- [Employment Services Program](/public-assistance/employment-services-program)\n\n\n## Public Utilities\n\n- [Low Income Home Energy Assistance Program (LIHEAP)](/public-assistance/low-income-home-energy-assistance-program)\n- [California Alternate Rates for Energy (CARE) Program](/public-assistance/california-alternate-rates-for-energy)\n"}]},{"url":"/public-assistance/assistance-dog-special-allowance","sections":[{"type":"Markdown-page","content":"# Assistance Dog Special Allowance Program (ADSA)\n\nWhat is the Assistance Dog Special Allowance Program (ADSA)?\nThe Assistance Dog Special Allowance (ADSA) program provides a monthly payment of $50 to eligible persons who use a guide, signal, or service dog to help them with their disability-related needs. The allowance is to help pay the costs of food, grooming, and health care for the dog.\n\nThe SMHS program provides medically necessary services to Medi-Cal beneficiaries.\n\n## Who is it for?\n\n- A resident of California, receiving one of the following:\n  - SSI (Supplemental Security Income)\n  - SSP (State Supplementary Payment)\n  - SSDI (Social Security Disability Insurance)\n  - IHSS (In-Home Supportive Services)\n  - CAPI (Cash Assistance Program for Immigrants)\n\n## How to apply?\n\n- Complete the following forms:\n  - Form ADSA1 if applicant receives SSI, SSP, IHSS, or CAPI.\n  - Form ADSA1B if applicant receives SSDI\n- Mail the application forms to:\n  - Assistance Dog Special Allowance Program, <br>\nCalifornia Department of Social Services,<br>\n744 P Street, MS 9-7-96,<br>\nSacramento, CA 95814"}]},{"url":"/public-assistance/calfresh","sections":[{"type":"Markdown-page","content":"# CalFresh\n\n## What is CalFresh?\t  \n                                                                                  \nThe CalFresh Program (federally known as the Supplemental Nutrition Assistance Program (SNAP), formerly known as Food Stamps) helps low-income households increase their food-buying power to meet their household’s nutritional needs. \n\nCalFresh benefits are issued monthly through Electronic Benefit Transfer, also known as the EBT card.\n\n\n## Who is CalFresh for?\n\nCalFresh is for people with low-income who meet federal income eligibility rules and want to add to their budget to put healthy and nutritious food on the table. \n\n## Who is eligible for CalFresh? \n\n- a resident of California\n- a US citizen, or a permanent resident for five years (certain restrictions apply)\n- a person with a qualified immigration status\n- annual household income below the amounts in the table below (based on the household situation)\n- a person who is 60+ or disabled may have a higher income and still qualify (see below for eligibility rules)\n\n## CalFresh Eligibility Rules for Elderly (60+) or Disabled Individuals\n\nThere is no gross income limit for individuals who are elderly (60+) or disabled. There is, however, a net income limit of 100% of the Federal Poverty Level.  Elderly or disabled individuals are also subject to resource limit of $3,750.\n\n## CalFresh Income and Benefit Chart for 10/1/2021 - 9/30/2022\n\n\n| Household Size  | Gross Monthly Income (200% of Poverty Level) | Net Monthly Income (100% of Poverty Level) | Maximum Monthly Benefit(Minimum $20) |\n|:-----------------|--------------:|--------------:|--------------:|\n| 1 | $2,148 | $1,074 | $250 | \n| 2 | $2,904 | $1,452 | $459 |\n| 3  | $3,660 | $1,830 | $658 |\n| 4 | $4,418 | $2,209 | $835 |\n| 5 | $5,174 | $2,587 | $992 |\n| 6 | $5,930 | $2,965 | $1,190 |\n| 7 | $6,688 | $3,344 | $1,316 |\n| 8 | $7,444 | $3,722 | $1,504 |\n| Each additional member | + $758 | $379 | + $188 |\n\n\n\n## What can you purchase with CalFresh?\n\nCalFresh can be used to buy any food or food product that is produced for human consumption. The exception to this is hot foods or lunch counter items prepared or heated in the store.\n\nIn addition, CalFresh benefits cannot be used to buy non-food items like soap, toilet paper, shampoo, alcoholic beverages and tobacco, vitamins or medicines, and pet food.\n\nHowever, you can use your California EBT Card to purchase seeds and plants for use in home gardens to produce food.\n\t\n## Where can you use your EBT card?\n\nRetail stores - to find a store that accepts EBT card, visit: [CA EBT Locator](https://www.ebt.ca.gov/locator/index.html#/locator.page)\n\nCalFresh Restaurant Meals Program – If you are homeless, disabled or 60 years of age or older, you can use your CalFresh EBT card to purchase hot, prepared food at some restaurants. \n\nTo find restaurants that accept EBT cards:\n- See [participating restaurants](https://socialservices.sccgov.org/sites/g/files/exjcpb701/files/documents/Restaurant-Meals-Program.pdf), or \n- [Locate participating restaurants near you](https://mymapscc.sccgov.org/Home/SearchResult?page=1&geocode=37.3316745,%20-121.9053698&selectedprogramfeature=CalFresh%20Double%20Up%20Food%20Bucks&selectedprogramfeature=CalFresh%20Food%20Restaurant%20Meals)\n\n\n\n### Local Farmers’ Markets \n\nWhen you use your CalFresh EBT card at a Market Match participating farmers’ market, you can double your money, up to $10 free per day. \n\n- [To see how it works](https://marketmatch.org/about/how-it-works/)\n- [Find a farmer's market that participates in the Market March program](https://ecologycenter.org/fmfinder/)\n\n\nYou can also purchase groceries online for home delivery using EBT card at [Amazon](https://www.amazon.com/s?k=ebt+amazon+fresh) and [Walmart](https://www.walmart.com/cp/snap-online/1465096?&adid=22222222254446207351&wmlspartner=wmtlabs&wl0=b&wl1=g&wl2=c&wl3=449835635931&wl4=dsa-1120015535512&wl5=1014109&wl6=&wl7=&wl8=&veh=sem&gclid=CjwKCAiAmrOBBhA0EiwArn3mfJbOi4L9tvwcGKGilhBzK9vRuf8MOm1rPi7BOuaSNQseu-daW516FxoCsL8QAvD_BwE).  Safeway, Albertsons, and Vons also accept EBT payments online. \n\nSee [EBT Online Flyer](https://www.cdss.ca.gov/Portals/9/CalFresh/EBTOnline/EBT-Online-Flyer-En_10_18_ADA.pdf?ver=2021-11-02-160405-223). \n\nDiscounts with your EBT card \n- [Discounted Amazon Prime](https://www.amazon.com/l/16256994011?&_encoding=UTF8&tag=lir0e-20&linkCode=ur2&linkId=3661ddae807c336a16207715b64d2285&camp=1789&creative=9325) memberships for customers who receive CalFresh or Medicaid benefits\n- [Discounted museum admission](https://museums4all.org/for-visitors/)\n- [Free cell phones and service](https://www.californialifeline.com/en)\n\n## How to apply for CalFresh?\n\nApply online: \n- www.GetCalFresh.org\n- http://www.mybenefitscalwin.org\n- Apply by phone - call the CalFresh Information Line [(877-847-3663)](tel:877-847-3663), or \n- Apply at your [local county office](https://calfresh.dss.ca.gov/food/officelocator/)\n\n## How to Check Your EBT Card Balance?\n\n- You can check your EBT card balance and buying history on the [CardHolder Portal](https://www.ebt.ca.gov/cardholder/), or \n- Call: [877-328-9677](tel:877-328-9677)\n"}]},{"url":"/public-assistance/california-alternate-rates-for-energy","sections":[{"type":"Markdown-page","content":"# California Alternate Rates for Energy (CARE) Program\n\n## What is the California Alternate Rates for Energy program?\n\nCalifornia Alternate Rates for Energy offers discounts on energy bills for income qualified households. Customers that are enrolled in the CARE program receive a 30% - 35% discount on their electric bill and a 20% discount on their natural gas bill.\n\n## Who is eligible for the CARE program?\n\n- Household income is at or below the income limits.\n- People who are enrolled in public assistance programs, such as Medi-Cal, WIC, CalFresh, LIHEAP, SSI, CalWORKs, National School Lunch's Free Lunch Program.\n\n## How to apply for the CARE program?\n\nTo request an application form and more information, please [contact your utility company](https://www.cpuc.ca.gov/lowincomerates/#fera) or check out their websites for more information.\n"}]},{"url":"/public-assistance/california-behavioral-health-services","sections":[{"type":"Markdown-page","content":"# California Behavioral Health Services\n\n[Medi-Cal Behavioral Health Division](https://www.dhcs.ca.gov/services/Pages/BHS.aspx) - Medi-Cal Behavioral Health Division (MCBHD) administers, oversees, and monitors the Medi-Cal Specialty Mental Health Services (SMHS) and Drug Medi-Cal programs.\n\nThe SMHS program provides medically necessary services to Medi-Cal beneficiaries.\n\nThe Drug Medi-Cal (DMC) program provides medically necessary substance use disorder (SUD) treatment services to Medi-Cal beneficiaries.\n\nThe programs are operated at the local level through contracts between the Department of Health Care Services (DHCS) and counties. MCBHD implements program changes related to behavioral health services required by state and federal laws and regulations.\n\nDHCS is California's single state Medicaid agency, and MCBHD is the liaison with the Centers for Medicare and Medicaid Services (CMS) for behavioral health services in California. Additionally, MCBHD provides subject matter expertise and technical assistance to other state departments and agencies, as well as to mental health managed care plans (MH MCPs), substance use disorder (SUD) MCPs, SUD fee-for-service (FFS) counties, and Medi-Cal MCPs.\n\nMCBHD is also responsible for state oversight of MH MCPs, SUD MCPs, and SUD FFS counties to ensure compliance with state and federal requirements.\n\n[The Substance Abuse and Mental Health Services Administration (SAMHSA)](https://www.samhsa.gov/) – SAMHSA is the agency within the U.S. Department of Health and Human Services that leads public health efforts to advance the behavioral health of the nation. SAMHSA's mission is to reduce the impact of substance abuse and mental illness on America's communities."}]},{"url":"/public-assistance/california-lifeline-phone-program","sections":[{"type":"Markdown-page","content":"# California LifeLine Phone Program\n\n[Watch a video about the program](https://raist3d.typepad.com/files/uei_lifelinephoneprogram_v3b.m4v)\n\n## What is California LifeLine Phone Program?\nCalifornia's Lifeline Program (California LifeLine) provides discounted home phone and free cell phone services if you can show that you qualify.\n\n\n## Who is eligible for California LifeLine?\n\n- If you or someone that you live with is enrolled in a public assistance program, then you are eligible. Programs that count include:\n  - Medi-Cal\n  - CalFresh (food stamps)\n  - Supplemental Security Income (SSI)\n  - Low Income Home Energy Assistance Program (LIHEAP)\n  - Women, Infants and Children Program (WIC)\n  - National School Lunch Program (NSLP)\n  - Temporary Assistance for Needy Families (TANF)\n- Even if you can't show enrollment in a public assistance program, you can still qualify if your household's total income for the last full year is below the annual income limits.\n\n\n## How to prove you are eligible\n\nTwo types of documents are required to apply for a California LifeLine phone:\n\n- Proof of identity containing a photo of you, your date of birth, and your street address (not a P.O box number), such as:\n  - ID card \n  - driver's license\n  - passport\n  - Mexican consular card\n- Proof that you meet the income eligibility, such as:\n  -  EBT card\n  - Medi-Cal card\n  - notice of eligibility or decision letter of participation from a qualifying public assistance program\n  - front page of last year's state or federal tax return\n  - Social Security statement\n  - Veterans Administration retirement/pension papers\n  - unemployment compensation papers\n\n\nMore information: [www.californialifeline.com](https://www.californialifeline.com/en/eligibility_requirements)."}]},{"url":"/public-assistance/calworks","sections":[{"type":"Markdown-page","content":"# CalWORKs\n\n## What is [CalWORKS](https://www.cdss.ca.gov/calworks)?\n\nCalWORKs (California Work Opportunity and Responsibility to Kids) is a cash aid program for low-income families, to help meet their basic needs. It also provides education, employment, and training programs to help families get jobs and move towards self-sufficiency. Childcare, transportation, work expenses, and counseling are available for families in work activities. There is a 48-month time limit for adults, but children can remain on aid if otherwise eligible under the Safety Net program. There are special services for pregnant and parenting teens through the Cal-Learn program.\n\n\n## Who is Eligible for CalWORKs?\n\n- There must be a child (under age 18 or under age 19 if the child is currently attending high school and will graduate before the child's 19th birthday) in the home who is deprived of parental support and care because one or both of their parents are:\n  - Deceased\n  - Disabled\n  - Unemployed, or\n  - Continuously absent from the home\n- Parents or caretakers of the eligible child\n- Pregnant women in their last trimester\n- Certain pregnant or parenting teens\n- Certain non-parent relatives who are caring for the child(ren)\n- California resident\n- US citizen, legal alien or qualified alien\n- Unemployed or underemployed and have low or very low income\n\n\n## How to Apply for CalWORKs\n\n- Apply online: www.MyBenefitsCalwin.org or\n- Contact Social Services within your county: [County Offices (ca.gov)](https://www.cdss.ca.gov/county-offices)"}]},{"url":"/public-assistance/cash-assistance-program-for-immigrants","sections":[{"type":"Markdown-page","content":"# Cash Assistance Program for Immigrants (CAPI)\n\n## What is the Cash Assistance Program for Immigrants (CAPI)?\n\nCAPI is a California state program which provides cash assistance to aged, blind and disabled legal non-citizens, who are not eligible for federal SSI/SSP (State Supplemental Payment) solely due to their immigration status.\n\n## Who is Eligible for the CAPI Program?\n\n- California resident\n- 65 or older, blind or with a disability.\n- Legal immigrant. Note: Deeming of the immigrants sponsors' income and property may apply to the immigrants who entered the US on or after 8/22/1996.\n- Have limited income and resources.\n- Unable to get federal SSI benefits because of your immigration status and for no other reasons.\n\n\n## What is the asset limit?\n\nAsset limit is $2,000 for a household of one person, $3,000 for a household of two persons.\n\n\n## How to Apply?\n\nThe best way to apply for CAPI depends on which California county you live in. For details, contact your local [county social services agency](https://www.cdss.ca.gov/county-offices).\n\nNote: Immigrants who may be eligible for SSI/SSP are required to apply for that program. Proof of SSI/SSP denial is required before CAPI benefits are paid."}]},{"url":"/public-assistance/childrens-health-insuarance-program","sections":[{"type":"Markdown-page","content":"# Children's Health Insurance Program (CHIP)\n\nThe Children's Health Insurance Program provides health insurance for free or for a low cost to children whose families fall in certain income brackets. \n\nMany families are considered mixed, which means that the children qualify for Medi-Cal or CHIP and adults are insured through Covered California."}]},{"url":"/public-assistance/earned-income-tax-credit","sections":[{"type":"Markdown-page","content":"# Earned Income Tax Credit (EITC)\n\n## What is Earned Income Tax Credit (EITC)?\n\nThe Earned Income Tax Credit (EITC) is a refundable tax credit for low- and moderate-income workers. If you qualify, you can use the credit to reduce the taxes you owe and maybe increase your refund.\n\n## Who is eligible for the Earned Income Tax Credit?\n\n- You must have at least $1 of earned income (pensions and unemployment don't count).\n- Your investment income must be $3,650 or less.\n- You can't claim the earned income tax credit if you're married filing separately.\n- You must be age 25 but under 65 at the end of the year.\n- You are a U.S. citizen or resident alien.\n\n\n## How to claim this credit?\n\n- File IRS Form 1040 US Individual Income Tax Return or Form 1040 SR US Tax Return for Seniors\n- If you have a qualifying child, you must also file the Schedule EIC (Form 1040 or 1040-SR), Earned Income Credit\n\nFor more information, visit the [Internal Revenue Service's Earned Income Tax Credit (EITC)](https://www.irs.gov/credits-deductions/individuals/earned-income-tax-credit-eitc) site."}]},{"url":"/public-assistance/employment-services-program","sections":[{"type":"Markdown-page","content":"# Employment Services Program\n\n- California EDD Jobs and Training – California Employment Development Department provides a range of employment and training services in partnership with state and local agencies and organizations through the [America's Job Center of California](https://edd.ca.gov/Office_Locator/), a one-stop access to the state's employment-related services.\n- [U.S. Department of Labor Adult Training Programs](https://www.dol.gov/general/topic/training/adulttraining) - The U.S. Department of Labor's [Employment and Training Administration (ETA)](https://www.dol.gov/agencies/eta) provides information on training programs and other services that are available to assist [workers](https://www.dol.gov/agencies/eta/layoffs/workers) who have been laid off or are about to be laid off. For a list of programs nearest you, contact an [American Job Center](https://www.careeronestop.org/localhelp/americanjobcenters/find-american-job-centers.aspx) or call ETA's toll-free help line at <a href=\"tel:18778895267\">1-877-889-5267 (1-877-US-2JOBS)</a>). Services are designed to meet local needs and may vary from state to state. Some services for dislocated workers have eligibility requirements. Check with your [State Dislocated Worker Unit](https://www.dol.gov/agencies/eta/layoffs/contact) for details."}]},{"url":"/public-assistance/general-assistance","sections":[{"type":"Markdown-page","content":"# General Assistance (GA)\n\n[Watch a video about the program](https://raist3d.typepad.com/files/uei_lifelinephoneprogram_v3b.m4v)\n\n\n## What Is the General Assistance (GA) Program?\n\nThe General Assistance Program provides cash assistance and employment services to adults with no dependent children who are not supported by their own means, other public funds, or assistance programs.\n\n## How Much Cash Does General Assistance Pay?\n\nPayment amounts range from $150 - $343 a month.\n\n## Who is Eligible for the GA Program?\n\n- 18 to 64 years of age\n- No dependent children\n- Resident of California\n- Have less than $500 in resources. \n  - Note: certain resources are not counted, therefore an individual may own them and still get GA, such as a home you live in\n- US citizen\n\n## Is General Assistance Considered a Loan?\n\nNo. You don't have to pay back your GA cash assistance.\n\nNote: if cash assistance is issued to you while your application for Supplemental Security Income/State Supplementary Payment (SSI/SSP) is being processed, the county may recover money from your initial retroactive SSI/SSP payment once approved.\n\n## Do GA Recipients have to Work while Receiving Cash Assistance?\n\nEmployment of GA participants is a major objective of the GA program. Able-bodied individuals are expected to find employment or participate in approved activities; employment-related education, training and/or job-search preparation through the Vocational Services (VS) program.\n\n## What If I Am Disabled and Unable to Work?\n\nYou will not be expected to participate in the Vocational Services (VS) program if you provide your County Eligibility Worker with a medical verification of your disability. You will be expected to apply for other available income such as Social Security Disability, Social Security Income (SSI) and/or State Disability (SDI or DIB).\n\nNote: if cash assistance is issued to you while your application for Supplemental Security Income/State Supplementary Payment (SSI/SSP) is being processed, the county may recovery money from your initial retroactive SSI/SSP payment once approved.\n\n## How to Apply for General Assistance?\n\n- Apply online: [mybenefitscalwin.org](https://mybenefitscalwin.org)\n- Contact Social Services within your county: [County Offices (ca.gov)](https://ca.gov)\n"}]},{"url":"/public-assistance/in-home-supportive-services","sections":[{"type":"Markdown-page","content":"# In-Home Supportive Services (IHSS) Program\n\n## What is the In-Home Supportive Services (IHSS) program?\n\nThe IHSS Program will help pay for services provided to you so that you can remain safely in your own home.\n\n## Who is eligible for the IHSS Program?\n\n- You must be a California resident.\n- You must have a Medi-Cal eligibility determination.\n- You must live\n  - at home; or\n  - in an RV if it has the necessary utilities needed to provide authorized IHSS (i.e. running water, electricity, heat, and appliances for the safe storage and preparation of food for meals) and can be situated in a single location for period of time; or\n  - in an abode of your own choosing (acute care hospital, long-term care facilities, and licensed community care facilities are not considered \"own home\").\n\n## How the program works:\n\nA county social worker will interview you at your home to determine your eligibility and need for IHSS. Based on your ability to safely perform certain tasks for yourself, the social worker will assess the types of services you need and the number of hours the county will authorize for each of these services.\n\nThis assessment will include information given by you and, if appropriate, by your family, friends, physician or other licensed health care professional.\n\nA completed Health Care Certification (SOC 873) must be received by the county prior to authorization of services.\n\nYou will be notified if IHSS has been approved or denied. If denied, you will be notified of the reason for the denial. If approved, you will be notified of the services and the number of hours per month which have been authorized for you.\n\nIf you are approved for IHSS, you must hire someone (your individual provider) to perform the authorized services. You are considered your provider's employer and, therefore, it is your responsibility to hire, train, supervise, and fire this individual.\n\nIf your county has contracted IHSS providers, you may choose to have services provided by the contractor.\n\nIf your county has homemaker employees, you may receive services from a county homemaker.\n\n## What services can the IHSS Program provide?\n\n- Housecleaning\n- Cooking\n- Shopping\n- Laundry\n- Taking you to and from medical appointments\n- Personal care services such as dressing, bathing, feeding, toileting\n- Paramedical services such as helping with injections, wound care, colostomy and catheter care as directed by a doctor\n\n## What services IHSS Program cannot Provide?\n\n- Moving furniture\n- Paying bills\n- Reading mail to you\n- Caring for pets, including service animals\n- Gardening\n- Repair services\n- Sitting with you to visit or watch TV\n- Taking you on social outings\n\n## How to apply?\n\nTo apply for IHSS, complete an [Application For In-Home Supportive Services](https://www.cdss.ca.gov/Portals/9/FMUForms/Q-T/SOC295.pdf) and submit it to [your county IHSS Office](https://www.cdss.ca.gov/inforesources/County-IHSS-Offices).\n\nFor more information, visit [In Home Supportive Services (ca.gov)](https://www.cdss.ca.gov/in-home-supportive-services)"}]},{"url":"/public-assistance/irs-free-file","sections":[{"type":"Markdown-page","content":"# IRS Free File – File Your Federal Taxes Online for Free\n\n## What is the IRS Free File Program?\n\nThe IRS Free File Program lets you prepare your own tax return and e-file it for free, either through brand-name software or fillable forms that do the hard work for you. IRS partners with many and many tax preparation and filing software industry leaders who provide their brand-name products for free. Free File providers also offer state return preparation, some for free as well.\n\n## Who is eligible for Free File?\n\nYou are eligible to file your taxes for free online using one of the Free File IRS partner offers if your adjusted gross income (AGI) was $72,000 or less.\n\n## Where do I find the IRS Free File providers?\n\nYou can browse all the offers or use the filters to narrow your results on this [Free File Offers page](https://apps.irs.gov/app/freeFile/browse-all-offers/) from the IRS.\n\nFor more information about this program, visit [the Internal Revenue Service Free File page](https://www.irs.gov/filing/free-file-do-your-federal-taxes-for-free)."}]},{"url":"/public-assistance/low-income-home-energy-assistance-program","sections":[{"type":"Markdown-page","content":"# Low Income Home Energy Assistance Program (LIHEAP)\n\n## What is the Low Income Home Energy Assistance Program?\n\nThe Low-Income Home Energy Assistance Program provides assistance to eligible low-income households with the goal of managing and meeting their immediate home heating and/or cooling needs.\n\n## Who is eligible for this program?\n\n- You must be a resident of California.\n- You need financial assistance with home energy costs. Eligibility for services may vary depending on sources of income and other factors. View LIHEAP Income Eligibility Guidelines.\n- If you or a family member participate in certain other benefit programs, e.g. CalFresh, SSI, CalWORKs, you automatically meet the eligibility requirement.\n\n## How to apply for the LIHEAP program?\n\n- Call <a href=\"tel:211\">2-1-1</a> 24 hours a day, 7 days a week.\n- Search on [www.211ca.org](http://www.211ca.org/) to find local resources.\n\nFor more information about LIHEAP program, visit the [Low Income Home Energy Assistance Program page on ca.gov](https://www.csd.ca.gov/Pages/LIHEAPProgram.aspx)."}]},{"url":"/public-assistance/medi-cal","sections":[{"type":"Markdown-page","content":"# Medi-Cal\n\n## What is Medi-Cal?\n\nMedi-Cal is California\"s part of a national health coverage program called Medicaid. \n\nMedi-Cal is a program that pays medical expenses for people with low income. This includes people who are aged, disabled, or have high medical costs. If you meet the requirements of the program, Medi-Cal will help pay for doctor visits, hospital stays, prescription drugs, rehabilitation, and other medical services.\n\n## Who is eligible for Medi-Cal?\n\nYou can qualify for Medi-Cal in many different ways. These different ways are called eligibility categories. For example, SSI-Linked Medi-Cal is an eligibility category that allows people who qualify for SSI to automatically get Medi-Cal. There are over 90 eligibility categories, each with its own rules and requirements. Once you meet the requirements of an eligibility category, you are eligible for either full or partial-scope Medi-Cal.\n\nFollowing describes the most common eligibility categories for people with disabilities:\n\n- If your family has income at or below 138% of the [Federal Poverty Level](https://ca.db101.org/glossary.htm#_q1986) (FPL) (266% of FPL if you're a child), you may be eligible for Income-Based Medi-Cal\n- If you qualify for [SSI (Supplemental Security Income)](https://ca.db101.org/glossary.htm#_q855), you are automatically eligible for SSI-Linked Medi-Cal\n- If you are aged or disabled, you may be eligible for Aged & Disabled Federal Poverty Level Medi-Cal\n- If you are disabled and working, you may be eligible for California's Working Disabled Program. You will have to pay a small premium for Medi-Cal coverage, but you can have countable income up to 250% of FPL\n- If you are aged, blind, or disabled, but your income is too high for other Medi-Cal programs, you may be eligible for Aged, Blind, and Disabled – Medically Needy Medi-Cal. For this program, you may need to spend a certain amount of your own money before Medi-Cal begins to pay for medical services. This payment is called a share of cost.\n\n## What services does Medi-Cal provide?\n\n### Primary Medical Care\n\n- Doctor visits\n- Diagnostic testing\n- Emergency services\n- Surgery\n- Hospitalization\n- Prescription drugs\n- Dental services\n- Health screenings for kids\n\n### Ongoing Care & Recovery\n\n- Personal care services [(IHSS)](https://ca.db101.org/ca/programs/health_coverage/medi_cal/ihss/program.htm)\n- Occupational & physical therapy\n- Outpatient drug abuse services\n- Nursing facility stays\n- Adult day health care\n\n### Other medical related costs\n\n- Medical supplies\n- Durable medical equipment\n- Transportation to doctor visits\n- Transportation costs for children with disabilities\n\n## How to apply?\n\n- Online using [BenefitsCal](http://www.benefitscal.org/).\n- Online using [Covered California](https://www.coveredca.com/), an online one-stop shop where you can learn about your public and private health coverage options.\n- In person at [your local county social services agency](https://www.dhcs.ca.gov/services/medi-cal/Pages/CountyOffices.aspx).\n- Using a [paper application](https://www.dhcs.ca.gov/services/medi-cal/eligibility/Pages/SingleStreamApps.aspx) (available in 11 languages) and mailing it in to [your local county social services agency](https://www.dhcs.ca.gov/services/medi-cal/Pages/CountyOffices.aspx).\n\nNote: If you get [Supplemental Security Income](https://ca.db101.org/glossary.htm#_q855) (SSI) or used to and now are on SSI [1619(b)](https://ca.db101.org/glossary.htm#_q1810), you automatically get Medi-Cal coverage. You do not need to apply for Medi-Cal."}]},{"url":"/public-assistance/section-8-housing-choice-voucher","sections":[{"type":"Markdown-page","content":"# Section 8 Housing Choice Voucher\n\n##  What is Section 8 Housing Choice Voucher program?\n\nThe housing choice voucher program provides assistance to low-income families. Housing can include single-family homes, townhouses and apartments and is not limited to units located in subsidized housing projects.\n\nHousing choice vouchers are administered locally by Public Housing Agencies (PHAs). A family that is issued a housing voucher is responsible for finding a suitable housing unit of the family's choice where the owner agrees to rent under the program. The family that is issued a housing choice voucher pays 30% of their monthly income for rent and the federal government pays the landlord the remainder through a local PHA.\n\n## Who is eligible for Section 8 Housing Choice Voucher Program?\n\n- You must be at least 18 years old and a U.S. citizen or a noncitizen who has eligible immigration status, including permanent resident.\n- You can apply to most nationwide waiting lists, regardless of where you currently live.\n- Households must make less than 50% of the [Area Median Income (AMI)](https://www.huduser.gov/portal/datasets/il.html) for the area where the voucher will be used.\n\n## How to apply for Housing Choice Voucher?\n\nTo apply for Housing Choice Voucher, visit [your local Public Housing Agency (PHA) in California](https://www.hud.gov/states/california/renting/hawebsites). Note: Some PHAs have long waiting lists, so you may want to apply at more than one PHA. Your PHA can also give you a list of locations at which your voucher can be used.\n\nMore information about housing choice vouchers, visit the U.S. Department of Housing and Urban Development's [Housing Choice Vouchers Fact Sheet](https://www.hud.gov/topics/housing_choice_voucher_program_section_8)"}]},{"url":"/public-assistance/section-8-project-based-voucher-program","sections":[{"type":"Markdown-page","content":"# Section 8 Project-Based Voucher (PBV) Program\n\n## What is Section 8 Project-Based Vouch (PBV) program?\n\nThe Project-Based Voucher (PBV) Program is a discretionary component of the Section 8 Housing Choice Voucher (HCV) program. The PBV attaches rental assistance to specific housing units in properties that are determined to be decent, safe and sanitary through the Housing Quality Standards inspection process. \n\nUnder the PBV program, local Public Housing Authority (PHA) enters into an assistance contract with the owner for specified units and for a specified term.\n\nTenants residing in Project-based units pay 30% of their income for rent and utilities, and the balance of their housing costs are paid by PHA. Tenants in Project-Based units are assisted as long as they live in the unit and continue to qualify for the program.\n\n## More information\n\n- [US Department of Housing and Urban Development project based vouchers information](https://www.hud.gov/program_offices/public_indian_housing/programs/hcv/project)\n- [Project Based Voucher information from Santa Clara County Housing](https://www.scchousingauthority.org/section-8-housing-programs/other-housing-programs-types/project-based-voucher/)"}]},{"url":"/public-assistance/social-security-disability-insurance","sections":[{"type":"Markdown-page","content":"# Social Security Disability Insurance (SSDI)\n\n## What is Social Security Disability Insurance (SSDI)?\n\nSSDI is a federal program that gives monthly cash benefits to people who have worked, paid Social Security taxes, and now have disabilities that prevent them from working.\n\n## Who is eligible for SSDI?\n\n- Disabled: Social Security Administration must decide that you are disabled.\n- Have worked a certain amount of time and have contributed enough in Social Security taxes.\n- You can apply to most nationwide waiting lists, regardless of where you currently live.\n\n## How do I know if my disability qualifies me for SSDI?\n\nYour disabling condition must be on Social Security\"s List of Impairments for you to qualify. If your disability is not on the list, Social Security has to decide that your condition is as severe as a condition that is on the list for you to qualify.\n\n## How is my SSDI benefit calculated?\n\nYour SSDI benefits amount is based on your average earnings from work over your lifetime. Small changes will be made to your benefits amount each year to account for changes in the cost of living.\n\n## How to apply for SSDI benefits:\n- Apply online (which starts the application process immediately instead of having to wait for an appointment)\n- By calling Social Security at <a href=\"tel:18007721213\">1-800-772-1213</a> or <a href=\"tel:18003250778\">1-800-325-0778</a> (TTY) to make an appointment to apply either:\n  - Over the phone\n  - In person at your local Social Security office"}]},{"url":"/public-assistance/supplemental-security-income","sections":[{"type":"Markdown-page","content":"# Supplemental Security Income (SSI)\n\n## What is Supplemental Security Income (SSI)?\n\nSupplemental Security Income is a federal program that provides monthly payments to people who are 65 or older as well as people of any age who are blind or who have disabilities.\n\n## Who is eligible for SSI?\n\n- People older than 18 but younger than 65, with disabilities and limited income and resources.\n- People who are 65 years old or older, with limited income and resources.\n- Qualifying children and youth under 18 with disabilities. A different definition of disability applies to people under 18.\n\n## What is the maximum SSI benefit?\n\nThe maximum monthly SSI benefit for 2021 is $954.72 for individuals and $1,598.14 for eligible couples. If you are blind, the maximum is $1,011.23 for an individual and $1,749.19 for a couple. \n\nSee [a complete listing of California maximum monthly payments](https://www.ssa.gov/pubs/EN-05-11125.pdf) for different situations maintained by the Social Security Administration.\n\n## Can a homeless person collect SSI benefits?\n\nYes. You don't have to have a fixed address to collect SSI benefits. If you are home\n\nYou don't have to have a fixed address to collect SSI benefits as anyone else. See [Social Security Administration's Spotlight on Homelessness](https://www.ssa.gov/ssi/spotlights/spot-homeless.htm).\n\n## How to apply?\n\n- [Apply online](https://www.ssa.gov/applyfordisability/) (which starts the application process immediately instead of having to wait for an appointment)\n- By calling Social Security at 1-800-772-1213 or 1-800-325-0778 (TTY) to make an appointment to apply either:\n  - Over the phone\n  - In person at [your local Social Security office](https://www.ssa.gov/locator/).\n\nLearn more about SSI, by visiting [Understanding Supplemental Security Income (SSI)](https://ssa.gov)"}]},{"url":"/public-assistance/volunteer-income-tax-assistance-and-tax-counseling-for-the-elderly","sections":[{"type":"Markdown-page","content":"# IRS's Volunteer Income Tax Assistance (VITA) & Tax Counseling for the Elderly (TCE) Programs\n\n## What is the Volunteer Income Tax Assistance (VITA) program?\n\nVITA is a program supported by the IRS that provides people who make roughly $57,000 or less a year with free assistance in preparing their tax returns. offers free basic tax return preparation to qualified individuals.\n\n## What is Tax Counseling for the Elderly (TCE) program?\n\nTCE is a program that offers free help, particularly for those who are age 60 or older, specializing in questions about pensions and retirement-related issues unique to seniors.\n\n## Who is eligible for VITA?\n\n- People who generally make $57,000 or less a year\n- Persons with disabilities; and\n- Limited English-speaking taxpayers\n\n## How to find a VITA or TCE site near you?\n\nThe following tools can help you to locate an open site near you:\n- [VITA/TCE Locator Tool](https://irs.treasury.gov/freetaxprep/)\n- [IRS2go app](https://www.irs.gov/newsroom/irs2goapp)\n"}]},{"url":"/public-assistance/vta-paratransit","sections":[{"type":"Markdown-page","content":"# VTA Paratransit\n\n## What is VTA paratransit?\n\nVTA paratransit is intended to serve as a \"safety net\" for individuals in Santa Clara County who, because of their disabilities, are unable to use fixed route bus or light rail.\n\nParatransit is shared ride public transportation, complementary to fixed route transit service. This means paratransit operates within the same service area and service times as VTA bus and light rail service. Customers can expect multiple pickups and drop offs along their trips, just like a bus.\n\n[VTA ACCESS paratransit service](https://www.vta.org/go/paratransit#accordion-eligibility-determination-%26-appeals) is provided to eligible individuals with disabilities who cannot use conventional accessible bus and light rail transit service due to their physical, visual or cognitive disabilities.\n\n## Eligibility Determination\n\nYour eligibility determination is based on the information you or your legal representative provided us during your application. Levels of eligibility are:\n\n- Unconditional eligibility means there are no conditions where you can take bus or light rail for your trips, so you can use ACCESS paratransit services anytime.\n- Conditional eligibility means there are sometimes where you can take bus or light rail, and there are other times where you cannot. When you are unable to make a trip on the bus or light rail you may book that trip on ACCESS paratransit. On your determination letter it will state under what conditions you can use ACCESS paratransit. Currently you decide when you can take the bus and when you need a paratransit trip. An ACCESS representative will not deny a trip because of your eligibility conditions, but we encourage you to take the bus when you can but are welcome to book with ACCESS paratransit when you need to.\n- Temporary means you only require ACCESS paratransit services for a short period of time while you recover, stabilize your condition, or other short-term circumstances.\n\n## How to apply for the VTA ACCESS Paratransit Service \n\n- Call <a href=\"tel:4083212380\">408-321-2380</a> (Monday-Friday 8am-5pm). [Visit the VTA site for more information on applying by phone ](https://www.vta.org/go/paratransit#accordion-phone-interview)\n- [Submit a Data Card](https://www.vta.org/go/paratransit#accordion-applying-for-vta-access-paratransit-service)\n- By mail: VTA Eligibility Department or drop off to 3331 N. First Street, San Jose, CA 95134, or\n- By fax: 408 238-1015"}]},{"url":"/resources/how-to-apply-for-a-duplicate-california-drivers-license","sections":[{"type":"Markdown-page","content":"# How to Apply for a Duplicate California Driver's License\n\n## Ways of making an application\n\n- [Complete a Driver's License (DL) or ID Card Application online](https://www.dmv.ca.gov/portal/driver-licenses-identification-cards/dl-id-online-app-edl-44/)\n- Make an appointment before visiting a DMV office. Appointment can be made at [www.dmv.ca.gov](https://www.dmv.ca.gov/) or by calling 1-800-777-0133.\n- [Visit a DMV office](https://www.dmv.ca.gov/portal/locations/), where you will:\n  - Provide your social security number (SSN).\n  - Verify your identity with [an acceptable identity document](https://www.dmv.ca.gov/portal/file/federal-non-compliant-dl-id-card-documents-list-pdf/). Your current name needs to match the name on the identity document.\n  - Present [acceptable residency documents](https://www.dmv.ca.gov/portal/file/federal-non-compliant-dl-id-card-documents-list-pdf/) (if you have never had a California DL/ID card).\n  - Pay the [application fee](https://www.dmv.ca.gov/portal/file/federal-non-compliant-dl-id-card-documents-list-pdf/).\n  - Have your thumbprint scanned.\n  - Have your photo taken.\n  - If you want to apply for a [REAL ID](https://www.dmv.ca.gov/portal/file/federal-non-compliant-dl-id-card-documents-list-pdf/), you must also provide proof of your identity, SSN, and two proofs of residency from the list of acceptable REAL ID documents.\n\n*Note:* Your name must match on all documents, including your SSN card. If your name doesn't match on your SSN card, you will need to go to the nearest Social Security office to present documentation to change your name on your SSN card, and then go to a DMV field office to apply for your driver's license.\n\n## Is there a fee?\n\nYes. [Find fees for applying for, renewing, changing, or replacing your driver's license](https://www.dmv.ca.gov/portal/driver-licenses-identification-cards/licensing-fees/).\n\nFor more information, visit [Requirements for a California Driver License - California DMV](https://www.dmv.ca.gov/portal/driver-licenses-identification-cards/licensing-fees/)"}]},{"url":"/resources/how-to-apply-for-a-replacement-social-security-card","sections":[{"type":"Markdown-page","content":"# How to Apply for a Replacement Social Security Card\n\nYou can apply for a replacement social security card online, by mail or in person at your local social security office. There is no charge for this service.\n\n## Apply online\n\nYou can [apply for a replacement Social Security card online](https://www.ssa.gov/myaccount/replacement-card.html) if you have a Social Security account, and if you:\n\n- Are a U.S. citizen age 18 or older with a U.S. mailing address (this includes APO, FPO, and DPO addresses)\n- Are not requesting a name change or any other change to your card; and\n- Have a driver's license or state-issued identification card from one of the many participating states or the District of Columbia.\n\n\n## Apply in person at a Social Security office that serve your area\n\n[Visit the SSA website to find your local social security office](https://secure.ssa.gov/ICON/main.jsp)\n\nYou will need to:\n\n- Fill out Form SS-5 Application for a Social Security Card\n- Bring the following original documents:\n  - Evidence of citizenship –\n    - U.S. birth certificate or\n    - U.S. passport\n    - Certificate of Citizenship or\n    - Certificate of Naturalization\n  - Evidence of age –\n    - U.S. birth certificate or\n    - U.S. passport\n  - Evidence of identity –\n    - U.S. driver's license or\n    - U.S. State-issued non-driver identity card or\n    - U.S. passport\n\n## Apply by mail:\n\nMail to any Social Security Office. [Visit the SSA website to find your local social security office](https://secure.ssa.gov/ICON/main.jsp)\n\nMail signed Form SS-5 Application for a Social Security Card, and\nThe following original documents (Social Security office will return any documents you mail to them)\n\n- Driver's license or ID card, and\n - U.S. Birth certificate or U.S. passport, or Certificate of Citizenship or Certificate of Naturalization\n\nFor more information [visit the SSA's Replacement Card site](https://www.ssa.gov/myaccount/replacement-card.html)"}]},{"url":"/resources/how-to-apply-for-california-identification-card","sections":[{"type":"Markdown-page","content":"# How to Apply for California Identification (ID) Card\n\n## What type of ID card do I need?\n\nThere are [3 types of ID cards](https://www.dmv.ca.gov/portal/driver-licenses-identification-cards/identification-id-cards/) in California:\n\n- [REAL ID card](https://www.dmv.ca.gov/portal/driver-licenses-identification-cards/real-id/): Starting October 1, 2021, you must present a federal compliant ID (such as a passport, military ID, or a REAL ID) to board a domestic flight or enter certain secure federal facilities like military bases, federal courthouses, or other federal buildings.\n- Standard ID card: Starting October 1, 2021, the standard ID card will no longer be accepted for use boarding domestic flights or entering federal facilities. It will, however, continue to be used to prove identity and age. Standard ID cards are valid for six birthdates after the application date.\n- Senior citizen ID card: Seniors 62 years old or older are eligible for a no-fee senior citizen ID card. Valid for eight birthdates after the application date.\n\n## How to apply for an ID card?\n\n- [Complete a Driver's License (DL) or ID Card Application online](https://www.dmv.ca.gov/portal/driver-licenses-identification-cards/dl-id-online-app-edl-44/)\n- Make an appointment before visiting a DMV office. Appointment can be made at [www.dmv.ca.gov](https://www.dmv.ca.gov/portal/) or by calling 1-800-777-0133.\n- [Visit a DMV office](https://www.dmv.ca.gov/portal/locations/), where you will:\n  - Provide your social security number (SSN).\n  - Verify your identity with [an acceptable identity document](https://www.dmv.ca.gov/portal/uploads/2020/06/federal_noncompliant_dl_docslist.pdf). Your current name needs to match the name on the identity document.\n  - Present [acceptable residency documents](https://www.dmv.ca.gov/portal/uploads/2020/06/residency_docslist.pdf) (if you have never had a California DL/ID card).\n  - Pay the nonrefundable [application fee](https://www.dmv.ca.gov/portal/uploads/2020/06/residency_docslist.pdf) (see below for information about reduced- and no-fee ID cards).\n  - Have your thumbprint scanned.\n  - Have your photo taken.\n  - If you want to apply for a [REAL ID](https://www.dmv.ca.gov/portal/driver-licenses-identification-cards/real-id/), you must also provide proof of your identity, SSN, and two proofs of residency from the list of acceptable REAL ID documents.\n\n*Note:* Your name must match on all documents, including your SSN card. If your name doesn't match on your SSN card, you will need to go to the nearest Social Security office to present documentation to change your name on your SSN card, and then go to a DMV field office to apply for your ID card.\n\nYou will receive your new ID card via mail within 3-4 weeks. If you have not received your new ID card after 60 days, call DMV at 1-800-777-0133 to check the status.\n\n## What is a No Fee and Reduced Fee ID Card?\n\nGenerally, a fee is required when applying for a new ID card, renewing an ID card, or changing your name. In certain circumstances, the fee may be waived or reduced:\n\n- Reduced fee ID card: You may be eligible to pay a reduced application fee for an original or renewal ID card if you meet income requirements for selected assistance programs. If you are eligible, the program will give you a completed Verification for Reduced Fee Identification Card (DL 937) form to take to DMV office. See your local public assistance program agency for information about eligibility requirements and obtaining a DL 937.\n- No-fee ID card: You may be eligible for a no-fee ID card if you are a “homeless person” as defined by the McKinney-Vento Act. This includes (but isn't limited to) a homeless child or youth, a homeless person, or an individual or family fleeing domestic violence, dating violence, sexual assault, stalking, or another dangerous, life-threatening condition.\n- Senior ID card: To qualify for a no-fee senior citizen ID card, you must be at least 62 years old.\n\n## How do I get an ID card fee waiver (No-fee ID card)?\n\n### Any person who can verify his/her status as a homeless person is eligible to receive the ID application fee waiver. You need to:\n\n- Obtain a DL 933 No Fee Identification Card Eligibility Verification form from a qualified Homeless Service Provider, such as government agency, public social service provider, non-profit agency, etc.\n- Fill out the form and get it signed by the homeless service provider verifying your homeless status\n- Bring the completed form to DMV when you apply for your ID card (REAL ID or Standard ID)\n\n### A homeless person is an individual who meets any of the following:\n\n- Currently at risk of losing permanent housing within the next 14 days\n- Currently without permanent housing\n- Currently not at risk of losing permanent housing in the next 14 days but meets all of the following criteria:\n  - Has experienced a long-term period without living independently in permanent housing\n  - Has experienced persistent instability as measured by frequent moves over such period\n  - Can be expected to continue in such status for an extended period of time because of chronic disabilities, chronic physical health or mental health conditions, substance addiction, histories of domestic violence or childhood abuse, the presence of a child or youth with a disability, or multiple barriers to employment.\n\nFor more information, visit [Requirements For A California Identification Card (FFDL 6)](https://www.dmv.ca.gov/portal/driver-education-and-safety/educational-materials/fast-facts/requirements-for-a-california-identification-card-ffdl-6/)"}]}]